# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Binaries
brew 'bash'
brew 'coreutils'
brew 'git'
brew 'neovim'
brew 'starship'
brew 'stow'
brew 'tmux'
brew 'zsh'

# Development
brew 'btop'
brew 'gemini-cli'
brew 'node'
brew 'nvm'
brew 'yarn'

# Apps
cask '1password'
brew '1password-cli'
cask 'cursor'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'ghostty'
cask 'keymapp'
cask 'kitty'
cask 'obsidian'
cask 'orbstack'
cask 'postman'
cask 'raycast'
cask 'rectangle-pro'
cask 'spotify'

# Fonts