brew 'bash'
brew 'btop'
brew 'codex'       # preferred CLI tool
brew 'coreutils'
brew 'fd'          # nvim
brew 'go'
brew 'node'
brew 'git'
brew 'neovim'      # nvim
brew 'nvm'
brew 'ripgrep'     # nvim
brew 'starship'
brew 'stow'
brew 'yarn'
brew 'zsh'

# Apps
cask '1password'
cask 'claude-code'
cask 'cursor'
cask 'discord'
cask 'docker-desktop'
cask 'ghostty'
cask 'keymapp'
brew 'lazygit'
brew 'loop'
cask 'obsidian'
cask 'orbstack'
cask 'postman'
cask 'proton-mail-bridge'
cask 'protonvpn'
cask 'raycast'
cask 'rectangle-pro'
cask 'spotify'

# VSCode Extensions
vscode 'alexdauenhauer.catppuccin-noctis-icons'
vscode 'catppuccin.catppuccin-vsc'
vscode 'christian-kohler.path-intellisense'
vscode 'dbaeumer.vscode-eslint'
vscode 'eamodio.gitlens'
vscode 'esbenp.prettier-vscode'
vscode 'github.vscode-pull-request-github'
vscode 'jock.svg'
vscode 'streetsidesoftware.avro'
vscode 'vscodevim.vim'
